html/articles/soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-28 vr 13:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Soup</title>
<meta name="author" content="Tobin Stultiens" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Soup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org11d2a50">1. Soup</a>
<ul>
<li><a href="#org8ec92b0">1.1. Miso Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Soup">Soup</span>&#xa0;<span class="Japanese">Japanese</span></span></a></li>
<li><a href="#org9275aab">1.2. Asperge Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Soup">Soup</span></span></a></li>
<li><a href="#orgfad2c85">1.3. Simple Champignon soup</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org11d2a50" class="outline-2">
<h2 id="org11d2a50"><span class="section-number-2">1.</span> Soup</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8ec92b0" class="outline-3">
<h3 id="org8ec92b0"><span class="section-number-3">1.1.</span> Miso Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Soup">Soup</span>&#xa0;<span class="Japanese">Japanese</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
This <a href="https://minimalistbaker.com/15-minute-miso-soup-with-greens-and-tofu/">recipe</a> was alright although quite fishy might need some adjustments.<br />
</p>
</div>
</div>
<div id="outline-container-org9275aab" class="outline-3">
<h3 id="org9275aab"><span class="section-number-3">1.2.</span> Asperge Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Soup">Soup</span></span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Voor 5l asperges soep<br />
ingredienten:<br />
</p>
<ul class="org-ul">
<li>250 boter<br /></li>
<li>3 dikke uien<br /></li>
<li>6 grote eetlepels meel en een ½ liter melk<br /></li>
<li>5 maggie blokken<br /></li>
<li>4 eieren<br /></li>
<li>3kg asperges (mag stukken zijn)<br /></li>
<li>Zout en peper naar smaak<br /></li>
<li>1 pakje slagroom<br /></li>
<li>2 Eetlepels fijn gerneden bieslook<br /></li>

<li>eerst de as asperges, schillen in stukken snijden en  15-20 koken.<br /></li>
<li>dan in een pan boter smelten en hierin de fijn gesnipperde uien bakken tot ze glazig zijn.<br /></li>
<li>meel erbij doen en goed roeren zodat er geen klonten ontstaan. dan de asperges met het water er bij doen en goed blijven roeren. Als laatste voeg de maggie blokken toe samen met zout en peper op smaak.<br /></li>
<li>Dit doe je tot het een bepaalde dikten heeft bereikt.<br /></li>
<li>dan het pakje slagroom, melk en de bieslook erbij doen.<br /></li>
<li>de eieren hard koken en met een vork klein pricken en erbij doen samen met gesneden ham.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgfad2c85" class="outline-3">
<h3 id="orgfad2c85"><span class="section-number-3">1.3.</span> Simple Champignon soup</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://www.youtube.com/watch?v=vgIplQn92gU&amp;t=196s">Link</a><br />
Ingredients:<br />
</p>
<ul class="org-ul">
<li>4 tablespoons unsalted butter (50g)<br /></li>
<li>2 pounds mixed mushrooms such as button, cremini, portabello, or shiitake (1kg), sliced<br /></li>
<li>Kosher salt and freshly ground black pepper<br /></li>
<li>1 medium onion, finely chopped (about 8 ounces; 225g)<br /></li>
<li>4 medium cloves garlic, minced<br /></li>
<li>2 tablespoons flour (45g)<br /></li>
<li>1 cup dry sherry or white wine (235ml)<br /></li>
<li>1 cup milk (235ml)<br /></li>
<li>5 cups (1.2L) homemade or store-bought low-sodium chicken stock, or water<br /></li>
<li>2 bay leaves<br /></li>
<li>2 sprigs fresh thyme<br /></li>
<li>Squeeze of lemon juice (optional)<br /></li>
<li>Minced fresh herbs such as parsley, chervil, tarragon, and chives for serving.<br /></li>
<li>Drizzle extra-virgin olive oil, for serving<br /></li>
</ul>

<p>
Directions:<br />
</p>
<ol class="org-ol">
<li>Melt butter in a large saucepan or Dutch oven over medium-high heat. Add mushrooms, season with salt and pepper, and cook, stirring frequently, until liquid has evaporated and mushrooms are well-browned, about 12 minutes total. Add onion and cook, stirring, until softened, about 3 minutes. Add garlic and cook until fragrant, about 30 seconds. Add flour and stir to combine.<br /></li>
<li>Add sherry or wine and cook until reduced by about half, scraping up browned bits from the bottom of the pan. Add milk, chicken stock, bay leaves, and thyme sprigs and stir to combine. Bring to a bare simmer and cook for 20 minutes.<br /></li>
<li>Using tongs, remove bay leaves and thyme. Blend soup with an immersion blender or in batches using a countertop blender. Season to taste with more salt and pepper and a squeeze of lemon juice (if desired). Serve immediately, garnished with minced herbs and olive oil.<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobin Stultiens</p>
<p class="date">Created: 2022-01-28 vr 13:09</p>
</div>
</body>
</html>
